// 1. Вивести в консоль всі числа від 1 до 10 за допомогою циклу while
let i = 1;
while (i <= 10) {
    console.log(i);
    i++;
}

// 2. Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. 
// Якщо число парне — пропустити його за допомогою continue.
for (let j = 2; j <= 20; j++) {
    if (j % 2 === 0) ; 
    console.log(j); 
}


// 3. Вивести в консоль таблицю множення числа 7 за допомогою циклу for
for (let k = 1; k <= 10; k++) {
    console.log(`7 x ${k} = ${7 * k}`);
}

// 4. Скрипт, який виводить всі числа, менші за n. Якщо >= n — break.
let n = 12; 
for (let m = 1; m <= 100; m++) {
    if (m >= n) break;
    console.log(m);
}

// 5. За допомогою while вивести всі числа від 1 до 20, крім чисел, кратних 3
let x = 1;
while (x <= 20) {
    if (x % 3 === 0) {
        x++;
        continue;
    }
    console.log(x);
    x++;
}
